{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "google/vit-base-patch16-224",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 16,
  "lora_dropout": 0.1,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "query",
    "value",
    "key",
    "dense"
  ],
  "task_type": "IMAGE_CLS"
}